[
    {
        "caption": "Монитор",
        "img": "img/goods/monitor.jpg",
        "brief_description": "Cтильное и высокопроизводительное устройство визуализации.",
        "full_description": "Дизайнеры и графические редакторы по достоинству оценят все преимущества широкоформатного ЖК монитора. Он создан на базе AH-IPS матрицы со временем отклика в 14 мс, обеспечивающей отличное качество изображения с любого ракурса и превосходную цветопередачу. Глянцевый 42.5-дюймовый экран с соотношением сторон 16:9, разрешением 3840 x 2160 пикселей и WLED-подсветкой обеспечивает высокую детализацию изображения. В арсенале этой модели ЖК монитора имеется 4-портовый концентратор USB 3.0 и пара цифровых HDMI коннекторов. При необходимости этот ЖК монитор можно закрепить на стене с помощью отдельно приобретаемого кронштейна VESA. Купить ЖК монитор со встроенными колонками - значит стать обладателем стильного и высокопроизводительного устройства визуализации по привлекательной цене.",
        "characteristics": [
            ["Тип оборудования", "ЖК-монитор с высоким разрешением (UHD, WQHD и т.п.)"],
            ["Колонки", "Встроенные; 2 x 7 Вт"],
            ["Глубина цвета матрицы", "10 бит/цвет (1.07 млрд. цветов)"],
            ["Контрастность LCD-матрицы", "1200:1 - статическая, 50M:1 - динамическая (SmartContrast)"],
            ["Время отклика", "5 мс GtG"]
        ]

    },
    {
        "caption": "Видеокарта",
        "img": "img/goods/videocard.jpg",
        "brief_description": "Оптимальное решение для игр в формате 4K.",
        "full_description": "Видеокарта с 8 ГБ видеопамяти GDDR6 и высокопроизводительной системой охлаждения – оптимальное решение для игр в формате 4K. Видеокарта используют графические процессоры с микроархитектурой Turing и совместимы с платформой разработки приложений RTX. Результат – в 6 раз более высокая производительность по сравнению с моделями предыдущего поколения и поддержка современных технологий искусственного интеллекта и трассировки лучей в режиме реального времени. DirectX 12: Инновационные визуальные эффекты и методы рендеринга делают игры еще более реалистичными. 4K: Высокая производительность видеокарт серии GeForce RTX позволяет наслаждаться современными играми в разрешении 4K – с невероятным уровнем детализации. Запатентованные вентиляторы Wing-blade создают повышенное воздушное давление при сниженном шуме по сравнению с обычными. Они обладают пыленепроницаемой конструкцией (сертификация IPX5) и могут полностью останавливаться под низкими нагрузками, делая видеокарту бесшумной. 2,7-слотовый форм-фактор позволил увеличить площадь поверхности радиатора более чем на 50% по сравнению с устройствами предыдущего поколения. Прочная усилительная пластина защищает печатную плату от изгибов и повреждений. 144-часовая программа валидации: строгие тесты гарантируют надежную работу устройства. Программное обеспечение GPU Tweak II позволяет легко управлять всеми параметрами видеокарты.",
        "characteristics": [
            ["Тип оборудования", "Игровая видеокарта"],
            ["Пропускная способность памяти", "448 Гб/сек"],
            ["Поддержка API", "DirectX 12, OpenGL 4.5"],
            ["Частота GPU", "1830 МГц максимум в режиме OC, 1815 МГц - в режиме Gaming mode (OC Edition)"],
            ["Кол-во шейдерных процессоров", "2944"]
        ]
    },
    {
        "caption": "Корпус",
        "img": "img/goods/case.jpg",
        "brief_description": "Стильный люминесцирующий корпус для игрового ПК",
        "full_description": "Водяное охлаждение для процессора в комплекте, Скрытая укладка шлейфов, Быстрый доступ к опорной пластине кулера, Полностью прозрачная боковая стенка корпуса",
        "characteristics": [
            ["Тип оборудования", "Корпус Bigtower"],
            ["Материал", "Сталь толщиной 0.8 мм"],
            ["Формат платы", "E-ATX (305 x 276 мм)"],
            ["Внутренних отсеков 2,5 дюйма", "6 (2.5'' SSD или HDD устанавливаются вместо 3.5'' HDD + 3 отдельных отсека)"],
            ["Охлаждение корпуса", "4 вентилятора: 140 x 140 мм (2 на радиаторе СВО, 1 под радиатором СВО и 1 на задней панели)"]
        ]
    }
]
